Repository: hexabinaer/cmsgarden
Catalog: translations/coffee-8.x-1.0-beta2.*.po
Languages: de

source: Menu
de: Menü

source: Permissions
de: Berechtigungen

source: About
de: Über

source: Uses
de: Verwendungszwecke

source: Go to
de: Gehe zu

source: Access Coffee
de: Coffee aufrufen

source: Access the Coffee search box to navigate fast between admin pages
de: Die Coffee-Schnellnavigation aufrufen, um schnell zwischen Seiten im Verwaltungsbereich zu wechseln

source: Go to front page
de: Zur Startseite gehen

source: Administer Coffee
de: Coffee verwalten

source: Administer the Coffee search module
de: Das Coffee-Modul verwalten

source: Coffee Menu Response
de: Coffee-Menürückmeldung

source: Configuration for the Coffee module.
de: Konfiguration für das Coffee-Modul

source: Provides an Alfred like search box to navigate within your site.
de: Stellt ein Alfred-ähnliches Suchfeld zum Navigieren innerhalb der Website bereit.

source: Select what menus coffee should search.
de: Menüs, die von Coffee durchsucht werden sollen, auswählen

source: Coffee configuration
de: Coffee-Konfiguration

source: Coffee settings
de: Coffee-Einstellungen

source: Coffee menus
de: Coffee-Menüs

source: Number of items to show in the search result
de: Die Anzahl der Elemente, die in den Suchergebnissen angezeigt werden soll

source: Menus to include
de: Zu durchsuchende Menüs auswählen

source: Select the menus that should be used by Coffee to search.
de: Auswahl der Menüs, die von Coffe für die Suche verwendet werden sollen

source: Max results
de: Max. Ergebnisse

source: Maximum number of items to show in the search results.
de: Die maximale Anzahl der Elemente, die in den Suchergebnissen angezeigt werden soll

source: The Coffee module offers quick navigation functionality as well as an extensible set of commands to let you jump around your site to desired pages very fast. The functionality is inspired by Alfred and Spotlight on Mac OS X. To activate the feature, either press the Coffee button in the toolbar or use the Alt-D keyboard shortcut (Alt + Shift + D in Opera, Alt + Ctrl + D in Windows Internet Explorer). For more information, see the <a href=":coffee">online documentation for the Coffee module</a>.
de: Das Coffee-Modul ermöglicht die Schnellnavigation durch den Administrationsbereich der Website und bietet zusätzlich einen erweiterbaren Satz von Befehlen, die dazu dienen bestimmte Seiten der Website besonders schnell aufrufen zu können. Das Modul wurde von den Mac OS X Programmen Alfred und Spotlight inspiriert. Um die Funktion zu aktivieren, kann entweder der Coffee-Button in der Werkzeugleiste angeklickt oder die Tastenkombination ALT+d verwendet werden. In Opera wird hierfür die Tastenkombination ALT+Shift+d verwendet. Im Windows Internet Explorer STRG+ALT+d. Weitere Informationen sind in der<a href=":coffee">Online Dokumentation des Coffee-Moduls</a> verfügbar.

source: Jumping to pages in the administration menu
de: Zu Seiten im Verwaltungsmenü springen

source: Start typing either part of the path or the title of an administration page you want to jump to. If the first result is the one you were looking for, just hit enter. If not, either continue typing or pick the right result from the list. You can also use your keyboard cursor keys to pick the desired result.
de: Mit der Eingabe einer Pfadangabe oder eines Titels einer Verwaltungsseite beginnen, um zu dieser Seite zu springen. Wenn das erste Ergebnis der Suche der Seite entspricht, nach der gesucht wird, die Enter-Taste drücken, um die Seite aufzurufen. Falls dies nicht der Fall ist, mit der Eingabe fortfahren oder das richtige Ergebnis aus der Liste wählen. Auch die Pfeiltasten können verwendet werden, um das gewünschte Ergebnis aus der Liste zu wählen.

source: Configuring additional menus and number of results
de: Zusätzliche Menüs und die Anzahl der Suchergebnisse konfigurieren

source: Coffee only searches in the administration menu by default. You can configure support for any other menu on <a href=":admin-coffee">the Coffee configuration page</a>. It is also possible to set the number of displayed results to less or more than the default 7.
de: Standardmäßig durchsucht Coffee nur das Administrationsmenü. Auf der <a href=":admin-coffee">Konfigurationsseite für Coffee</a> kann aber auch jedes andere Menü aktiviert werden. Weiterhin kann die Anzahl von angezeigten Suchergebnissen niedriger oder höher als der Standardwert von 7 eingestellt werden.

source: Additional commands
de: Zusätzliche Befehle

source: Coffee also supports an extensible set of commands. The two built-in commands are <code>:front</code> which results in the front page and <code>:add</code> which provides a list of all content types to create new content with. The <code>:add</code> command may receive the name of the content type as well, therefore <code>:add:Article</code> also works. Other modules may provide further commands.
de: Das Coffee-Modul unterstützt außerdem einen erweiterbaren Satz von Befehlen. Die beiden bereits vom Modul bereitgestellten Befehle sind: <code>:front</code>, welcher die Startseite aufruft und <code>:add</code>, der eine Liste aller Inhaltstypen, aus denen heraus neue Inhalte erstellt werden könne, anzeigt. Der Befehl <code>:add</code> nimmt außerdem den Namen des Inhaltstyps entgegen. Das bedeutet, dass beispielsweise <code>:add:Article</code> bzw. <code>add:Artikel</code> ebenfalls funktioniert. Zusatzmodule stellen eventuell weitere Befehle für Coffee bereit.

source: Users with the <em>Administer Coffee</em> permission can configure available menus and number of result, while the <em>Access Coffee</em> permission grants the use of the feature itself to users.
de: Benutzer mit der <em>Coffee verwalten</em> Berechtigung können verfügbare Menüs und die Anzahl an Suchergebnissen konfigurieren, während die <em>Zugriff auf Coffee</em> Berechtigung es Benutzern erlaubt das Coffee-Modul selbst zu verwenden.

source: Use alt+d to start Coffee and search for a page to go to
de: Alt+d drücken, um Coffee zu starten und nach der gewünschten Seite zu suchen.
